; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	spectrograph4 - mode
	thermograph1 - mode
	spectrograph3 - mode
	image0 - mode
	infrared2 - mode
	GroundStation2 - direction
	Star4 - direction
	GroundStation1 - direction
	Star8 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation7 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 image0)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star8)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star8)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument5 spectrograph4)
	(supports instrument5 image0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 infrared2)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 GroundStation6)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 GroundStation5)
	(supports instrument9 image0)
	(supports instrument9 spectrograph4)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star0)
	(supports instrument10 spectrograph4)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 GroundStation7)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(have_image Planet9 spectrograph4)
	(have_image Planet10 thermograph1)
	(have_image Star11 spectrograph3)
	(have_image Phenomenon12 thermograph1)
	(have_image Star13 image0)
))

)

; plan
1. (turn_to satellite3 groundstation7 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 groundstation7)
   goals met: 0 of 5
2. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 0 of 5
3. (calibrate satellite3 instrument10 groundstation7)
   added: (calibrated instrument10)
   goals met: 0 of 5
4. (turn_to satellite3 planet10 groundstation7)
   deleted: (pointing satellite3 groundstation7)
   added: (pointing satellite3 planet10)
   goals met: 0 of 5
5. (take_image satellite3 planet10 instrument10 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 1 of 5
6. (turn_to satellite3 phenomenon12 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon12)
   goals met: 1 of 5
7. (turn_to satellite1 groundstation1 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 5
8. (take_image satellite3 phenomenon12 instrument10 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 2 of 5
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 5
10. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 2 of 5
11. (turn_to satellite1 star11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star11)
   goals met: 2 of 5
12. (take_image satellite1 star11 instrument3 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 3 of 5
13. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 3 of 5
14. (take_image satellite1 star13 instrument3 image0)
   added: (have_image star13 image0)
   goals met: 4 of 5
15. (turn_to satellite3 planet9 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet9)
   goals met: 4 of 5
16. (take_image satellite3 planet9 instrument10 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 5 of 5
